<?php



function getCategories(){
//    $categoriesDeclaration
    return [
        0 => 'Недвижимость',
        1 => 'Транспорт',
        2 => 'Личные вещи',
        3 => 'Хобби и отдых',
        4 => 'Услуги',
        5 => 'Бытовая техника',
        6 => 'Другое',
    ];
}


function getCities(){
    return [
        0 => 'Москва',
        1 => 'Санкт-Петербург',
        2 => 'Новосибирск',
        3 => 'Екатеринбург',
        4 => 'Нижний Новгород',
        5 => 'Казань',
        6 => 'Челябинск',
        7 => 'Омск',
        8 => 'Самара',
        9 => 'Ростов-на-Дону',
        10 => 'Уфа',
        11 => 'Красноярск',
        12 => 'Пермь',
        13 => 'Воронеж',
        14 => 'Волгоград',
        15 => 'Томск',
    ];
}

function debug($arr){
    echo '<pre>' . print_r($arr, true). '</pre>';
}
